<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Template;

class TemplateSeeder extends Seeder
{
    public function run(): void
    {
        $templates = [

            [
                'name' => 'Template 1',
                'content' => '<p style="text-align: center;"><strong>بیانِ گواہان با اقرارِ صالح مورخہ: {{data}}</strong></p><ol><li><p><strong>1-محمد سلیم ولد راجہ محمد خان ساکنہ ٹھوٹھہ مہر تحصیل و ضلع مظفر آباد</strong></p></li><li><p><strong>2-وقاص اصغر ولد محمد اصغر ساکنہ لنگڑ پورٹ</strong> [مقام کا نام]</p></li></ol><p>بیان کیا کہ مظہران سائل/سائلہ/سائلان حاضر عدالت کے خاندان کو ذاتی طور پر بخوبی جانتے ہیں۔ خاندان سائل/سائلہ/سائلان موضع <strong>{{village}}</strong> تحصیل و ضلع مظفرآباد کا / کی / کے مستقل سکونتی ہے / ہیں۔ سائل / سائلہ / سائلان کے والد کا نام <strong>{{person_name}}</strong> اور دادا کا نام <strong>{{grandfather_name}}</strong> ہے۔ خاندانِ سائل / سائلہ / سائلان قبل از سال 1947ء بیکرمی ریاست میں مستقل طور پر آباد اور کھیوٹ دار چلا آ رہا ہے۔ کبھی ترکِ سکونت کی ہے اور نہ ہی آئندہ ترکِ سکونت کا ارادہ رکھتے ہیں۔ سائل / سائلہ / سائلان نے قبل ازیں سرٹیفکیٹ باشندہ ریاست درجہ اول حاصل نہ کیا ہے استدعا ہے کہ سائل / سائلہ / سائلان کے حق میں سرٹیفکیٹ باشندہ ریاست جاری فرمایا جائے۔</p><p></p><p>________________        _________________</p><p style="text-align: left;"><strong>ROAC</strong></p><p style="text-align: left;"></p>'
            ],

            [
                'name' => 'Template 2',
                'content' => '<p style="text-align: center;"><strong>بیانِ والد/سائل/سائلہ/سائلان با اقرار صالح مورخہ {{date}}</strong></p>

<p><strong>{{person_name}} ولد {{father}} ساکن {{village}}</strong></p>

<p>
بیان کیا ہے کہ مظہر حال موضع <strong>{{village}}</strong> تحصیل و ضلع مظفر آباد کا مستقل رہائشی ہے۔
خاندان مظہر مہاجر سال <strong>{{migration_year}}</strong> ہے۔
خاندان مظہر مقبوضہ کشمیر کے علاقہ <strong>{{region}}</strong> تحصیل <strong>{{tehsil}}</strong> ضلع <strong>{{district}}</strong> سے ہجرت کر کے آزاد علاقہ مظفر آباد میں رہائش پذیر ہوا۔
بعد ازاں کبھی ترکِ سکونت نہیں کی ہے اور نہ ہی آئندہ ترکِ سکونت کا ارادہ ہے۔
سائل / سائلہ / سائلان مظہر کے پسر / دختر ہیں۔
سائل / سائلہ / سائلان ہمراہ مظہر آباد ہیں۔
سائل / سائلہ / سائلان نے قبل ازیں سرٹیفکیٹ پشتنی ریاست درجہ اول حاصل نہ کیا ہے اور نہ ہی اس کے حصول کے لیے درخواست دائر کی ہے۔
خاندان مظہر ریاستی باشندہ درجہ اول ہے۔
استدعا ہے کہ بحق سائل / سائلہ / سائلان سرٹیفکیٹ پشتنی ریاست درجہ اول جاری فرمایا / فرمائے جائیں۔
</p>

<p></p> 

<p style="text-align: right;"><strong>__________________</strong></p>
<p style="text-align: left;"><strong>R.O.A.C</strong></p>'
            ],

            // [
            //     'name' => 'Template 3',
            //     'content' => '<p style="text-align: center;"><strong>بیانِ گواہان با اقرار صالح مورخہ{{Date}}</strong></p><p> 1۔ نام <strong>محمد سلیم</strong> ولدیت <strong>محمد خان</strong> ساکن <strong>ٹھوٹھہ</strong> شناختی کارڈ نمبر -------</p><p> 2۔ نام <strong>وقاص اصغر</strong> ولدیت <strong>محمد اصغر</strong> ساکن <strong>نیورٹ</strong> شناختی کارڈ نمبر -------</p><p>ہم با اتفاقِ رائے بیان کرتے ہیں سائل/سائلہ/سائلان موضع <strong>_____</strong> تحصیل و ضلع مظفر آباد کا/کے مستقل سکونتی ہے/ہیں۔ خاندانِ سائل/سائلہ/سائلان نے قبل ازیں ترکِ سکونت نہ کی ہے اور نہ ہی آئندہ ترکِ سکونت کا ارادہ ہے۔ خاندانِ سائل/سائلہ/سائلان کا آبائی قبرستان دھ     ہذا میں ہے۔ سائل/سائلہ/سائلان مذہبی تہوار ضلع مظفر آباد میں مناتا ہے/مناتے ہیں۔ سائل/سائلہ/سائلان نے ابتدائی تعلیم ضلع مظفر آباد سے حاصل کی ہے۔ سائل/سائلہ/سائلان کے حق میں قبل ازیں سرٹیفکیٹ پشتنی ریاست درجہ اول جاری شدہ/زیرِ کارہے۔ سائل/سائلہ/سائلان نے قبل ازیں ضلع مظفر آباد یا آزاد کشمیر/پاکستان کے کسی ضلع سے ڈومیسائل سرٹیفکیٹ حاصل نہ کیا ہے۔ استدعا ہے کہ سائل/سائلہ/سائلان کے حق میں ہماری ذاتی شناخت اور ذمہ داری پر ڈومیسائل سرٹیفکیٹ جاری فرمایا جائے/فرمائے جائیں۔</p><p style="text-align: right;"></p><p style="text-align: right;">  ____________________</p><p style="text-align: left;"><strong>R.O.A.C          </strong></p>'
            // ],


            [
                'name' => 'Template 3',
                'content' => '<p style="text-align: center;"><strong>بیانِ گواہان با اقرار صالح مورخہ{{Date}}</strong></p><p> 1۔ نام <strong>{{witness1_name}}</strong> ولدیت <strong>{{witness1_father}}</strong> ساکن <strong>{{witness1_address}}</strong> شناختی کارڈ نمبر {{witness1_cnic}}</p><p> 2۔ نام <strong>{{witness2_name}}</strong> ولدیت <strong>{{witness2_father}}</strong> ساکن <strong>{{witness2_address}}</strong> شناختی کارڈ نمبر {{witness2_cnic}}</p><p>ہم با اتفاقِ رائے بیان کرتے ہیں سائل/سائلہ/سائلان موضع <strong>{{village}}</strong> تحصیل و ضلع {{district}} کا/کے مستقل سکونتی ہے/ہیں۔ خاندانِ سائل/سائلہ/سائلان نے قبل ازیں ترکِ سکونت نہ کی ہے اور نہ ہی آئندہ ترکِ سکونت کا ارادہ ہے۔ خاندانِ سائل/سائلہ/سائلان کا آبائی قبرستان {{graveyard}} میں ہے۔ سائل/سائلہ/سائلان مذہبی تہوار ضلع {{district}} میں مناتا ہے/مناتے ہیں۔ سائل/سائلہ/سائلان نے ابتدائی تعلیم ضلع {{district}} سے حاصل کی ہے۔ سائل/سائلہ/سائلان کے حق میں قبل ازیں سرٹیفکیٹ پشتنی ریاست درجہ اول جاری شدہ/زیرِ کارہے۔ سائل/سائلہ/سائلان نے قبل ازیں ضلع {{district}} یا آزاد کشمیر/پاکستان کے کسی ضلع سے ڈومیسائل سرٹیفکیٹ حاصل نہ کیا ہے۔ استدعا ہے کہ سائل/سائلہ/سائلان کے حق میں ہماری ذاتی شناخت اور ذمہ داری پر ڈومیسائل سرٹیفکیٹ جاری فرمایا جائے/فرمائے جائیں۔</p><p style="text-align: right;"></p><p style="text-align: right;">  ____________________</p><p style="text-align: left;"><strong>R.O.A.C          </strong></p>'
            ],

            // [
            //     'name' => 'Template 4',
            //     'content' => '<p style="text-align: center;"><strong>بيان سائل / اسائلہ / سائلان با اقرار صالح مورخہ {{Date}}</strong></p><p style="text-align: center;"></p><p><strong>1-عبدالعدیل ولد چوہدری محمد سلیم مہر ساکنہ ٹھوٹھہ تحصیل و ضلع مظفرآباد</strong></p><p><strong>2-____________________________________</strong></p><p>بیان کیا کہ مظہر / مظہرہ / مظہران حال موضع <strong>______</strong> تحصیل و ضلع <strong>_________</strong> کا / کی / کے مستقل سکونتی ہے / ہیں۔ مظہر / مظہرہ / مظہران کے والد کا نام <strong>_________</strong> اور دادا کا نام <strong>________</strong> ہے۔ خاندانِ سائل مظہر / مظہرہ / مظہران قبل از سال <strong>1942ء</strong> بیکرمی ریاست میں مستقل طور پر آباد اور کیوٹ دار چلا آ رہا ہے۔ کبھی ترکِ سکونت کی اور نہ ہی آئندہ ترکِ سکونت کا ارادہ ہے۔ مظہر / مظہرہ / مظہران نے قبل ازیں سرٹیفکیٹ باشندہ ریاست درجہ اول حاصل نہ کیا ہے۔ استدعا ہے کہ بحق مظہر / مظہرہ / مظہران سرٹیفکیٹ باشندہ ریاست درجہ اول جاری فرمایا جائے۔</p><p></p><p><strong>   __________________</strong></p><p style="text-align: left;">   <strong>R.O.A.C       </strong></p>'
            // ],

            [
                'name' => 'Template 4',
                'content' => '<p style="text-align: center;"><strong>بيان سائل / اسائلہ / سائلان با اقرار صالح مورخہ {{Date}}</strong></p><p style="text-align: center;"></p><p><strong>1-{{witness1_name}} ولد {{witness1_father}} ساکنہ {{witness1_address}} تحصیل و ضلع {{district}}</strong></p><p><strong>2-{{witness2_name}}</strong></p><p>بیان کیا کہ مظہر / مظہرہ / مظہران حال موضع <strong>{{village}}</strong> تحصیل و ضلع <strong>{{district}}</strong> کا / کی / کے مستقل سکونتی ہے / ہیں۔ مظہر / مظہرہ / مظہران کے والد کا نام <strong>{{father_name}}</strong> اور دادا کا نام <strong>{{grandfather_name}}</strong> ہے۔ خاندانِ سائل مظہر / مظہرہ / مظہران قبل از سال <strong>1942ء</strong> بیکرمی ریاست میں مستقل طور پر آباد اور کیوٹ دار چلا آ رہا ہے۔ کبھی ترکِ سکونت کی اور نہ ہی آئندہ ترکِ سکونت کا ارادہ ہے۔ مظہر / مظہرہ / مظہران نے قبل ازیں سرٹیفکیٹ باشندہ ریاست درجہ اول حاصل نہ کیا ہے۔ استدعا ہے کہ بحق مظہر / مظہرہ / مظہران سرٹیفکیٹ باشندہ ریاست درجہ اول جاری فرمایا جائے۔</p><p></p><p><strong>   __________________</strong></p><p style="text-align: left;">   <strong>R.O.A.C       </strong></p>'
            ],

        ];

        foreach ($templates as $template) {
            Template::create([
                'name' => $template['name'],
                'content' => $template['content'],
                'user_id' => 1
            ]);
        }
    }
}
